In [1]:
import numpy as np
import pandas as pd

In [2]:
# when you have invalid values other than missing data

df = pd.DataFrame({
    "Sex": ["M", "F", "F", "D","?"],
    "Age": [29, 30, 24, 290, 25]
})

In [3]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [4]:
#finding unique values in the column
df["Sex"].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [5]:
df["Sex"].value_counts() # counts of each unique value

Sex
F    2
M    1
D    1
?    1
Name: count, dtype: int64

In [6]:
# replace() function to clean invalid values
df["Sex"].replace("D", "F")

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [7]:
# replacing multiple values at once, also accepts a dictionary

df["Sex"].replace({"D":"F", "?":"M"})

0    M
1    F
2    F
3    F
4    M
Name: Sex, dtype: object

In [8]:
# if you have many values to be replaced in multiple columns, apply the same logic as above at DataFrame level

df.replace({
    "Sex": {"D":"F", "?":"M"},
    "Age": {290: 29}    
}) # dictionary within a dictionary for multi-column replacement

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   M   25

In [9]:
df[df["Age"] > 100] # filtering out invalid values, we are saying anything over 100 is just not credible data

  Sex  Age
3   D  290

In [10]:
df.loc[df["Age"] > 100, "Age"] = df.loc[df["Age"] > 100, "Age"].astype(int) / 10 # converting to int and dividing by 10 if it's over 100

In [11]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25

In [12]:
#DUPLICATE VALUES

In [13]:
writers = pd.Series([
    'Russia',
    'Russia',
    'Russia',
    'United Kingdom',
    'United Kingdom',
    'France',
    'Japan',
], index=[
    'Leo Tolstoy',
    'Fyodor Dostoevsky',
    'Anton Chekhov',
    'William Shakespeare',
    'Jane Austen',
    'Victor Hugo',
    'Haruki Murakami'
])

In [14]:
writers

Leo Tolstoy                    Russia
Fyodor Dostoevsky              Russia
Anton Chekhov                  Russia
William Shakespeare    United Kingdom
Jane Austen            United Kingdom
Victor Hugo                    France
Haruki Murakami                 Japan
dtype: object

In [15]:
# duplicated() method to find duplicates

writers.duplicated() # returns a boolean series indicating whether the value has been repeated before or not

Leo Tolstoy            False
Fyodor Dostoevsky       True
Anton Chekhov           True
William Shakespeare    False
Jane Austen             True
Victor Hugo            False
Haruki Murakami        False
dtype: bool

The keep= Parameter
The keep parameter controls which duplicates (if any) to mark as False (not duplicates). It has three options:

1. keep='first' (default)
The first occurrence of each value is not marked as duplicate
All subsequent occurrences are marked as duplicates.
2. keep='last'
The last occurrence of each value is not marked as duplicate
All previous occurrences are marked as duplicates.
3. keep=False
Marks all duplicates as True (including first and last)
Only unique values will be False
# Example with 'first':
writers.duplicated(keep='first')
# Example with 'last':
writers.duplicated(keep='last')
# Example with False:
writers.duplicated(keep=False)

In [16]:
writers.duplicated(keep=False) # marks all duplicates as True (including first and last)

Leo Tolstoy             True
Fyodor Dostoevsky       True
Anton Chekhov           True
William Shakespeare     True
Jane Austen             True
Victor Hugo            False
Haruki Murakami        False
dtype: bool

In [17]:
writers.duplicated(keep='first') # marks the first occurrence of each value as not duplicate, and subsequent occurrences as duplicates, the default behavior

Leo Tolstoy            False
Fyodor Dostoevsky       True
Anton Chekhov           True
William Shakespeare    False
Jane Austen             True
Victor Hugo            False
Haruki Murakami        False
dtype: bool

In [18]:
writers.duplicated(keep='last') # marks the last occurrence of each value as not duplicate, and previous occurrences as duplicates

Leo Tolstoy             True
Fyodor Dostoevsky       True
Anton Chekhov          False
William Shakespeare     True
Jane Austen            False
Victor Hugo            False
Haruki Murakami        False
dtype: bool

In [19]:
(writers.duplicated(keep=False) & writers.duplicated()).sum() # This will give you a count of all duplicated rows in your DataFrame.

3

In [20]:
# dropping duplicates(): This function is used to remove duplicate rows from the DataFrame based on specified columns. If no column is passed, it removes entire row if any value is repeated in that row.

writers.drop_duplicates() # Removes all duplicate rows from the DataFrame

Leo Tolstoy                    Russia
William Shakespeare    United Kingdom
Victor Hugo                    France
Haruki Murakami                 Japan
dtype: object

In [21]:
writers.drop_duplicates(keep="last") # Keeps only the last occurrence of each duplicated row and removes others)

Anton Chekhov              Russia
Jane Austen        United Kingdom
Victor Hugo                France
Haruki Murakami             Japan
dtype: object

In [22]:
writers.drop_duplicates(keep=False) # Removes all rows that have any duplicates (all occurrences are removed).

Victor Hugo        France
Haruki Murakami     Japan
dtype: object

In [23]:
#DUPLICATES IN DATAFRAME

In [24]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

In [25]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [26]:
players.duplicated() # Returns a boolean Series indicating whether each row is a duplicate or not.

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [27]:
# since Kobe Bryant has two SG positions, it will return True for the second and subsequent rows of Kobe Bryant. But to get all Kobe duplicates, we need to use subset parameter:

players.duplicated(subset=['Name']) # Returns a boolean Series indicating whether each row is a duplicate or not, only considering the 'Name' column.

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [28]:
players.duplicated(subset=["Name"], keep='last') # Returns a boolean Series indicating whether each row is a duplicate or not, but considers the last occurrence as unique.

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [29]:
#dropping duplicates:
players.drop_duplicates() # Drops all rows that are duplicates, keeping only the first occurrence.

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [30]:
# looks like we've got Kobe twice again since the POS column was not considered in the subset. So let's consider both columns for dropping duplicates:
players.drop_duplicates(subset=['Name'], keep='last') # Drops all rows that are duplicates, keeping only the last occurrence.

              Name Pos
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [31]:
#SPLITTING COLUMNS

In [32]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})

In [33]:
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [34]:
#use split() to split the column into multiple columns:
df["Data"].str.split("_") # This will return a list of split strings for each row in the column.

0       [1987, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [35]:
df["Data"].str.split("_", expand=True) # This will split the column into multiple columns and create a DataFrame with these new columns.

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [36]:
df = df["Data"].str.split("_", expand=True)

In [37]:
df.columns = ['Year', 'Gender', 'Country', 'Num of Children'] # This will rename the columns of the new DataFrame to more descriptive names.

In [38]:
df

    Year Gender Country Num of Children
0   1987      M     US                1
1  1990?      M      UK               1
2   1992      F      US               2
3  1970?      M      IT               1
4   1985      F    I  T               2

In [39]:
# split_data = df['Data'].str.split('_', expand=True)
# split_data.columns = ['Year', 'Gender', 'Country', 'Number']
# split_data

In [40]:
df["Year"].str.contains("\?") # This will check if the "Year" column contains any question marks and return a boolean Series indicating whether each element matches the pattern or not.
# contains  takes a regex/pattern as first value, so we need to escape the `?` symbol as it has a special meaning for these patterns.

<>:1: SyntaxWarning: invalid escape sequence '\?'
<>:1: SyntaxWarning: invalid escape sequence '\?'
/tmp/ipykernel_908778/1341134894.py:1: SyntaxWarning: invalid escape sequence '\?'
  df["Year"].str.contains("\?") # This will check if the "Year" column contains any question marks and return a boolean Series indicating whether each element matches the pattern or not.

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [41]:
df["Country"].str.contains("U") # This will check if the "Country" column contains any 'U' and return a boolean Series indicating whether each element matches the pattern or not.

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

In [42]:
# removing blank spaces from the columns' values

df["Country"].str.strip() # This removes leading and trailing whitespace characters (including spaces, tabs, etc.) from the strings in the "Country" column.

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [43]:
# since we have a whitespace issue in between the country names, let's replace it with an empty string:
df["Country"].str.replace(" ", "") # This replaces all occurrences of the specified pattern (in this case, a space) with an empty string.

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object

In [47]:
df['Year'] = df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'), regex=True) # This regex pattern is used to extract the year from a string that might have a question mark at the end, and replace it with an empty , need to set the regex=True parameter in your call to str.replace() to enable regular expression matching. The lambda function is used to return the extracted year as a string.

In [46]:
df

   Year Gender Country Num of Children
0  1987      M     US                1
1  1990      M      UK               1
2  1992      F      US               2
3  1970      M      IT               1
4  1985      F    I  T               2